Repository: sjain882/OMSI-Crossing-Editor-Tools
Catalog: OMSICrossingEditorTools/Languages/Strings.*.resx
Languages: de, fi, fr

# ConfirmDefaults
source: Are you sure you want to restore the default settings? Your existing settings will be sent to the Recycle Bin.
de: Sind Sie sicher, dass Sie die Standardeinstellungen wiederherstellen möchten? Ihre bestehenden Einstellungen werden in den Papierkorb verschoben.
fi: Oletko varma, että haluat palauttaa oletusasetukset? Nykyiset asetukset siirretään roskakoriin.
fr: Êtes-vous sûr de vouloir restaurer les paramètres par défaut? Vos paramètres existants seront envoyés à la corbeille.

# ErrorBadIniFile
source: The .ini configuration file is either missing or invalid! Would you like to create/restore the default settings (Yes), or manually fix them yourself (No)?
de: Die .ini-Konfigurationsdatei ist entweder nicht vorhanden oder ungültig! Möchten Sie die Standardeinstellungen erstellen/wiederherstellen (Ja), oder diese manuell korrigieren (Nein)?
fi: .ini-määritystiedosto puuttuu tai se on virheellinen! Haluaisitko luoda/palauttaa oletusasetukset (Kyllä), vai haluatko korjata ne manuaalisesti (Ei)?
fr: Le fichier de configuration .ini est soit manquant, soit invalide ! Voulez-vous créer/restaurer les paramètres par défaut (Oui), ou les corriger manuellement vous-même (Non)?

# ErrorDefaultIni
source: Failed to create the default .ini configuration file. Please try again later. If this error persists, please contact the author of this software.
de: Die Standard-.ini-Konfigurationsdatei konnte nicht erstellt werden. Bitte versuche es später erneut. Wenn dieser Fehler weiterhin auftritt, wende dich bitte an den Autor dieser Software.
fi: Oletus .ini -määritystiedoston luominen epäonnistui. Yritä myöhemmin uudelleen. Mikäli virhe toistuu uudelleen, ota yhteyttä tämän ohjelmiston tekijään.
fr: Le fichier de configuration .ini par défaut n'a pas pu être créé. Veuillez réessayer ultérieurement. Si cette erreur persiste, veuillez contacter l'auteur de ce logiciel.

# ErrorFailedToEnableTool
source: Failed to enable the tool, for some reason. Please contact the author of this software.
de: Das Tool konnte nicht aktiviert werden. Bitte wenden Sie sich an den Autor dieser Software.
fi: Virhe käynnistettäessä työkalua: Tuntematon virhe. Ole hyvä ja ota yhteyttä ohjelmiston tekijään.
fr: Impossible d'activer l'outil, pour une raison quelconque. Veuillez contacter l'auteur de ce logiciel.

# ErrorGeneric
source: Internal error. Exiting...
de: Interner Fehler. Das Programm wird beendet.
fi: Sisäinen virhe. Ohjelmistoa suljetaan...
fr: Erreur interne. Fermeture...

# ErrorMultipleInstances
source: Multiple instances of OMSI Crossing Editor (OmsiObjEditP.exe) are running! Please close all but one of the windows. Ensure it is running and has a crossing loaded before enabling this tool.
de: Es laufen mehrere Instanzen des OMSI Crossing Editors (OmsiObjEditP.exe)! Bitte schließen Sie alle weiteren Instanzen. Vergewissern Sie sich, dass das Programm läuft und eine Kreuzung geladen ist, bevor Sie dieses Tool aktivieren.
fi: Useita OMSI Crossing Editor (OmsiObjEditP.exe) on käynnissä! Ole hyvä ja sulje kaikki ylimääräiset ikkunat. Varmista, että ohjelmisto on käynnissä, ja että jokin risteys on ladattuna ennen työkalun käyttöönottoa.
fr: Plusieurs instances d'OMSI Crossing Editor (OmsiObjEditP.exe) sont en cours d'exécution ! Veuillez fermer toutes les fenêtres sauf une. Assurez-vous qu'il fonctionne et qu'un croisement est chargé avant d'activer cet outil.

# ErrorToolNotRunning
source: OMSI Crossing Editor (OmsiObjEditP.exe) is not running! Ensure it is running and has a crossing loaded before enabling this tool.
de: Der OMSI Crossing Editor (OmsiObjEditP.exe) wird nicht ausgeführt! Vergewissern Sie sich, dass das Programm läuft und eine Kreuzung geladen ist, bevor Sie dieses Tool aktivieren.
fi: OMSI Crossing Editor (OmsiObjEditP.exe) ei ole käynnissä! Varmista, että ohjelmisto on käynnissä, ja että jokin risteys on ladattuna ennen työkalun käyttöönottoa.
fr: OMSI Crossing Editor (OmsiObjEditP.exe) n'est pas en cours d'exécution ! Assurez-vous qu'il fonctionne et qu'un croisement est chargé avant d'activer cet outil.

# FirstLaunchMessage
source: If you have any games open that use anti-cheat software, please close them immediately (for technical reasons)! You should also exclude this tool from all anti-virus programs. You will not be reminded next time!
de: Wenn Sie Spiele geöffnet haben, die Anti-Cheat-Software verwenden, schließen Sie diese bitte sofort (aus technischen Gründen)! Sie sollten dieses Tool auch von allen Antivirenprogrammen ausschließen. Sie werden beim nächsten Mal nicht daran erinnert!
fi: Mikäli sinulla on anti-cheat ohjelmistoa käyttäviä sovelluksia päällä, sulje ne välittömästi teknisten syiden takia. On myös toivottavaa, että tämä sovellus jätetään pois kaikista antivirus -ohjelmista. Asiasta ei muistuteta uudelleen!
fr: Si vous avez des jeux ouverts qui utilisent un logiciel anti-triche, veuillez les fermer immédiatement (pour des raisons techniques) ! Vous devez également exclure cet outil de tous les programmes antivirus. Vous ne serez pas rappelé la prochaine fois !

# FirstLaunchMessageTitle
source: OMSI Crossing Editor Tools - First Launch Message
de: OMSI Crossing Editor Tools - Erste Startnachricht
fi: OMSI Crossing Editor Tools - Ensimmäisen käynnistyksen viesti
fr: OMSI Crossing Editor Tools - Premier message de lancement

# iniDefaults1
source: ; On start-up, these values will be set
de: ; Beim Start werden diese Werte gesetzt
fi: ; Nämä arvot asettuvat käynnistyksen yhteydessä
fr: ; Au démarrage, ces valeurs seront définies

# iniDefaults2
source: ; These initial provided values match the original tool's behaviour
de: ; Die anfänglich vorgegebenen Werte entsprechen dem Verhalten des Originalwerkzeugs
fi: ; Annetut arvot vastaavat alkuperäisen työkalun käyttäytymistä
fr: ; Ces valeurs initiales fournies correspondent au comportement de l'outil original.

# iniHeader
source: ; OMSI Crossing Editor Tools - Settings
de: ; OMSI Crossing Editor Tools - Einstellungen
fi: ; OMSI Crossing Editor Tools - Asetukset
fr: ; OMSI Crossing Editor Tools - Paramètres

# iniLimits
source: ; Useful for fast mouse wheel scroll speeds
de: ; Nützlich für schnelle Mausrad-Scrollgeschwindigkeiten
fi: ; Hyödyllinen nopean hiiren rullausarvoihin
fr: ; Utile pour les vitesses de défilement rapides de la molette de la souris

# iniScroll1
source: ; The amounts to adjust the zoom/fov by when scrolling the mouse wheel
de: ; Die Beträge, um der die Entfernung beim Scrollen mit dem Mausrad angepasst wird
fi: ; Zoomauksen/fov:n säädettävät määrät näkyvät rullatessa hiiren rullaa
fr: ; Les valeurs permettant d'ajuster le zoom/fov lors du défilement de la molette de la souris.

# iniScroll2
source: ; Scrolling up adds to the zoom/fov and scrolling down subtracts from it...
de: ; Nach Oben scrollen vergrößert die Entfernung und nach unten scrollen verkleinert diese...
fi: ; Ylös rullaaminen lisää zoomausta/fov:ta, alas rullaaminen taas vähentää siitä...
fr: ; Le défilement vers le haut ajoute au zoom/fov et le défilement vers le bas le soustrait...

# iniScroll3
source: ; ...currently, that behaviour cannot be changed
de: ; ...derzeit kann dies noch nicht geändert werden
fi: ; ..tällä hetkellä kyseistä käytöstä ei voida muuttaa
fr: ; ...actuellement, ce comportement ne peut pas être modifié

# iniSection
source: ; [Section]
de: ; [Abschnitt]
fi: ; [Osasto]

# iniSetting
source: ; Setting = Value
de: ; Einstellung = Wert
fi: ; Asetus = Arvo
fr: ; Paramètre = Valeur

# iniUsage
source: ; Usage:
de: ; Verwendung:
fi: ; Käyttö:
fr: ; Utilisation:

# iniValidValuesNumbers
source: ; Valid values: Only numbers (e.g., 1.2, 0.1, 0, 1, 2, 45)
de: ; Gültige Werte: Nur Zahlen (z.B. 1.2, 0.1, 0, 1, 2, 45)
fi: ; Kelpuutetut arvot: numerot (mm. 1.2, 0.1, 0, 1, 2, 45)
fr: ; Valeurs valides : Uniquement des nombres (par exemple, 1,2, 0,1, 0, 1, 2, 45).

# ReferToReadme
source: Refer to the Readme.txt included with the download.
de: Bitte lesen Sie die Readme.txt, die im Download enthalten ist.
fi: Viittaa latauksen mukana tulleeseen Readme.txt -tiedostoon.
fr: Reportez-vous au fichier Readme.txt inclus dans le téléchargement.

# TrayMenuDisable
source: Disable tool
de: Tool deaktivieren
fi: Poista työkalu käytöstä
fr: Désactiver l'outil

# TrayMenuEdit
source: Edit settings...
de: Einstellungen bearbeiten...
fi: Muokkaa asetuksia...
fr: Modifier les paramètres...

# TrayMenuEnable
source: Enable tool
de: Tool einschalten
fi: Ota työkalu käyttöön
fr: Activer l'outil

# TrayMenuExit
source: Exit
de: Beenden
fi: Poistu
fr: Quitter

# TrayMenuHelp
source: Help && about...
de: Hilfe && Info...
fi: Apua & tietoa...
fr: Aide et à propos...

# TrayMenuReload
source: Reload settings
de: Einstellungen neu laden
fi: Päivitä asetukset
fr: Recharger les paramètres

# TrayMenuRestore
source: Restore default settings...
de: Standardeinstellungen wiederherstellen...
fi: Palauta oletusasetukset...
fr: Restaurer les paramètres par défaut...
